rhoenschrat/DJI-Remote/sdkconfig.defaults.m5stack_basic_v27
# Configuration for M5Stack Basic V2.7 (ESP32)
#
CONFIG_IDF_TARGET="esp32"

# Bluetooth configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# Flash configuration for M5Stack Basic V2.7 (16MB Flash)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# CPU frequency
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# SPI Configuration for Display
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# UART Configuration for GPS
CONFIG_UART_ISR_IN_IRAM=y

# Power Management
CONFIG_PM_ENABLE=y

# Partition Table - Use large app partition to accommodate boot logo
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

